In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame()

In [8]:
df['A'] = np.arange(3)

In [9]:
type(df['A'])

pandas.core.series.Series

In [11]:
df['Name'] = ['Aayush','Nirajan','Ozil']

In [18]:
student = [
    {"name": "Saka", "club": "Arsenal", "league": "Premier League"},
    {"name": "Saka", "club": "Arsenal", "league": "Premier League"},
    {"name": "Saka", "club": "Arsenal", "league": "Premier League"}
]

In [19]:
pd.DataFrame(student)

   name     club          league
0  Saka  Arsenal  Premier League
1  Saka  Arsenal  Premier League
2  Saka  Arsenal  Premier League

Date, Sales, Store

In [20]:
df = pd.DataFrame({
    'Date': pd.date_range("20200101",periods=6),
    'Sales': [1,2,3,4,5,6],
    'Store': ['KTMCty','Daraz','Hamrobazzar','Adidas','Nike','Reebok'],
    'Profit':[3000,4000,2000,9000,7000,2000]
})

In [21]:
df

        Date  Sales        Store  Profit
0 2020-01-01      1       KTMCty    3000
1 2020-01-02      2        Daraz    4000
2 2020-01-03      3  Hamrobazzar    2000
3 2020-01-04      4       Adidas    9000
4 2020-01-05      5         Nike    7000
5 2020-01-06      6       Reebok    2000

In [23]:
df[(df.Sales > 4) & (df.Profit > 5000)]

        Date  Sales Store  Profit
4 2020-01-05      5  Nike    7000

In [28]:
df['Day'] = df.Date.dt.day

In [30]:
df['Month'] = df.Date.dt.month

In [47]:
df

        Date  Sales        Store  Profit  Day  Month
0 2020-01-01      1       KTMCty    3000    1      1
1 2020-01-02      2        Daraz    4000    2      1
2 2020-01-03      3  Hamrobazzar    2000    3      1
3 2020-01-04      4       Adidas    9000    4      1
4 2020-01-05      5         Nike    7000    5      1
5 2020-01-06      6       Reebok    2000    6      1

In [49]:
df['Items'] = [4,5,6,3,2,8]

In [56]:
df

        Date  Sales        Store  Profit  Day  Month  Items
0 2020-01-01      1       KTMCty    3000    1      1      4
1 2020-01-02      2        Daraz    4000    2      1      5
2 2020-01-03      3  Hamrobazzar    2000    3      1      6
3 2020-01-04      4       Adidas    9000    4      1      3
4 2020-01-05      5         Nike    7000    5      1      2
5 2020-01-06      6       Reebok    2000    6      1      8

In [60]:
def divide(val):
    if val.Profit<7000:
        return 0.15
    else:
        return

In [64]:
def new_func(val):
    if val<7000 and val>4000:
        return 0.85*val
    elif val<4000:
        return val
    else:
        return 0.7*val

In [65]:
df.Profit.map(new_func)

0    3000.0
1    2800.0
2    2000.0
3    6300.0
4    4900.0
5    2000.0
Name: Profit, dtype: float64

In [66]:
df

        Date  Sales        Store  Profit  Day  Month  Items
0 2020-01-01      1       KTMCty    3000    1      1      4
1 2020-01-02      2        Daraz    4000    2      1      5
2 2020-01-03      3  Hamrobazzar    2000    3      1      6
3 2020-01-04      4       Adidas    9000    4      1      3
4 2020-01-05      5         Nike    7000    5      1      2
5 2020-01-06      6       Reebok    2000    6      1      8

In [67]:
df['Area'] = ['Ktm','Pok','Ktm','Ktm','Pok','Chit']
df

        Date  Sales        Store  Profit  Day  Month  Items  Area
0 2020-01-01      1       KTMCty    3000    1      1      4   Ktm
1 2020-01-02      2        Daraz    4000    2      1      5   Pok
2 2020-01-03      3  Hamrobazzar    2000    3      1      6   Ktm
3 2020-01-04      4       Adidas    9000    4      1      3   Ktm
4 2020-01-05      5         Nike    7000    5      1      2   Pok
5 2020-01-06      6       Reebok    2000    6      1      8  Chit

In [75]:
#Convert into dataframe while using groupby method

In [74]:
df.groupby('Area').Profit.agg(['sum'])

   Area    sum
0  Chit   2000
1   Ktm  14000
2   Pok  11000

In [76]:
df

        Date  Sales        Store  Profit  Day  Month  Items  Area
0 2020-01-01      1       KTMCty    3000    1      1      4   Ktm
1 2020-01-02      2        Daraz    4000    2      1      5   Pok
2 2020-01-03      3  Hamrobazzar    2000    3      1      6   Ktm
3 2020-01-04      4       Adidas    9000    4      1      3   Ktm
4 2020-01-05      5         Nike    7000    5      1      2   Pok
5 2020-01-06      6       Reebok    2000    6      1      8  Chit

In [81]:
data = pd.pivot_table(df,values='Profit',index = 'Date',columns='Store',aggfunc="sum")
data

Store       Adidas   Daraz  Hamrobazzar  KTMCty    Nike  Reebok
Date
2020-01-01     NaN     NaN          NaN  3000.0     NaN     NaN
2020-01-02     NaN  4000.0          NaN     NaN     NaN     NaN
2020-01-03     NaN     NaN       2000.0     NaN     NaN     NaN
2020-01-04  9000.0     NaN          NaN     NaN     NaN     NaN
2020-01-05     NaN     NaN          NaN     NaN  7000.0     NaN
2020-01-06     NaN     NaN          NaN     NaN     NaN  2000.0

In [82]:
data.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [48]:
df.Profit.map(lambda x: 0.85*x)

0    2550.0
1    3400.0
2    1700.0
3    7650.0
4    5950.0
5    1700.0
Name: Profit, dtype: float64

In [36]:
store_encoding = pd.get_dummies(df['Store'],prefix = 'store')

In [40]:
store_encoding

,store_Adidas,store_Daraz,store_Hamrobazzar,store_KTMCty,store_Nike,store_Reebok
0,False,False,False,True,False,False
1,False,True,False,False,False,False
2,False,False,True,False,False,False
3,True,False,False,False,False,False
4,False,False,False,False,True,False
5,False,False,False,False,False,True

In [45]:
store_encoding = store_encoding.applymap(lambda x:1 if x else 0)

In [46]:
store_encoding.store_Adidas.map(lambda x: -1 if x==1 else x)

0    0
1    0
2    0
3   -1
4    0
5    0
Name: store_Adidas, dtype: int64